nxp-mcuxpresso/mcux-sdk-examples/frdmrw612/driver_examples/ctimer/capture/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 0.15.4
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_io_mux.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: F3, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: E8, peripheral: GPIO, signal: 'PIO1, 20', pin_signal: GPIO_52, direction: OUTPUT}
  - {pin_num: D8, peripheral: CTIMER0, signal: 'CAPTURE, 0', pin_signal: GPIO_51}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* pmux clock control: Enable clock */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the GPIO1 module */
    GPIO_PortInit(GPIO, 1);

    gpio_pin_config_t gpio1_pinE8_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_20 (pin E8)  */
    GPIO_PinInit(GPIO, 1U, 20U, &gpio1_pinE8_config);
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24 (pin F3) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
    /* Initialize CT_INP11 functionality on pin GPIO_51 (pin D8) */
    IO_MUX_SetPinMux(IO_MUX_CT_INP11);
    /* Initialize GPIO52 functionality on pin GPIO_52 (pin E8) */
    IO_MUX_SetPinMux(IO_MUX_GPIO52);
    /* CT_INP11 signal is selected for CTIMER0 capture input 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_Gpio51Inp11ToTimer0CaptureChannels);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
